<template>
  <metainfo>
    <template v-slot:title="{ content, metainfo }">{{ content }}</template>
  </metainfo>

  <Header
      :header="this.header_block"
      @popUpCall="popUpCall()"
  />

  <div class="policy-view">
    <div class="policy-max">
      <h1 class="policy-title">Политика в отношении обработки персональных данных</h1>
      <h2 class="policy-subtitle">1. Общие положения</h2>
      <div class="def-text">Настоящая политика обработки персональных данных составлена в соответствии с требованиями
        Федерального закона от 27.07.2006. № 152-ФЗ «О персональных данных» (далее — Закон о персональных данных) и
        определяет порядок обработки персональных данных и меры по обеспечению безопасности персональных данных,
        предпринимаемые {{ this.ip }} (далее — Оператор).
      </div>
      <div class="enum-text">1.1. Оператор ставит своей важнейшей целью и условием осуществления своей деятельности
        соблюдение прав и свобод человека и гражданина при обработке его персональных данных, в том числе защиты прав на
        неприкосновенность частной жизни, личную и семейную тайну.
      </div>
      <div class="enum-text">1.2. Настоящая политика Оператора в отношении обработки персональных данных (далее —
        Политика) применяется ко всей информации, которую Оператор может получить о посетителях веб-сайта
        {{ this.domain }}.
      </div>
      <h2 class="policy-subtitle">2. Основные понятия, используемые в Политике</h2>
      <div class="enum-text">2.1. Автоматизированная обработка персональных данных — обработка персональных данных с
        помощью средств вычислительной техники.
      </div>
      <div class="enum-text">2.2. Блокирование персональных данных — временное прекращение обработки персональных данных
        (за исключением случаев, если обработка необходима для уточнения персональных данных).
      </div>
      <div class="enum-text">2.3. Веб-сайт — совокупность графических и информационных материалов, а также программ для
        ЭВМ и баз данных, обеспечивающих их доступность в сети интернет по сетевому адресу {{ this.domain }}.
      </div>
      <div class="enum-text">2.4. Информационная система персональных данных — совокупность содержащихся в базах данных
        персональных данных и обеспечивающих их обработку информационных технологий и технических средств.
      </div>
      <div class="enum-text">2.5. Обезличивание персональных данных — действия, в результате которых невозможно
        определить без использования дополнительной информации принадлежность персональных данных конкретному
        Пользователю или иному субъекту персональных данных.
      </div>
      <div class="enum-text">2.6. Обработка персональных данных — любое действие (операция) или совокупность действий
        (операций), совершаемых с использованием средств автоматизации или без использования таких средств с
        персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление,
        изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание,
        блокирование, удаление, уничтожение персональных данных.
      </div>
      <div class="enum-text">2.7. Оператор — государственный орган, муниципальный орган, юридическое или физическое
        лицо, самостоятельно или совместно с другими лицами организующие и/или осуществляющие обработку персональных
        данных, а также определяющие цели обработки персональных данных, состав персональных данных, подлежащих
        обработке, действия (операции), совершаемые с персональными данными.
      </div>
      <div class="enum-text">2.8. Персональные данные — любая информация, относящаяся прямо или косвенно к определенному
        или определяемому Пользователю веб-сайта {{ this.domain }}.
      </div>
      <div class="enum-text">2.9. Персональные данные, разрешенные субъектом персональных данных для распространения, —
        персональные данные, доступ неограниченного круга лиц к которым предоставлен субъектом персональных данных путем
        дачи согласия на обработку персональных данных, разрешенных субъектом персональных данных для распространения в
        порядке, предусмотренном Законом о персональных данных (далее — персональные данные, разрешенные для
        распространения).
      </div>
      <div class="enum-text">2.10. Пользователь — любой посетитель веб-сайта {{ this.domain }}.</div>
      <div class="enum-text">2.11. Предоставление персональных данных — действия, направленные на раскрытие персональных
        данных определенному лицу или определенному кругу лиц.
      </div>
      <div class="enum-text">2.12. Распространение персональных данных — любые действия, направленные на раскрытие
        персональных данных неопределенному кругу лиц (передача персональных данных) или на ознакомление с персональными
        данными неограниченного круга лиц, в том числе обнародование персональных данных в средствах массовой
        информации, размещение в информационно-телекоммуникационных сетях или предоставление доступа к персональным
        данным каким-либо иным способом.
      </div>
      <div class="enum-text">2.13. Трансграничная передача персональных данных — передача персональных данных на
        территорию иностранного государства органу власти иностранного государства, иностранному физическому или
        иностранному юридическому лицу.
      </div>
      <div class="enum-text">2.14. Уничтожение персональных данных — любые действия, в результате которых персональные
        данные уничтожаются безвозвратно с невозможностью дальнейшего восстановления содержания персональных данных в
        информационной системе персональных данных и/или уничтожаются материальные носители персональных данных.
      </div>
      <h2 class="policy-subtitle">3. Основные права и обязанности Оператора</h2>
      <div class="enum-text">3.1. Оператор имеет право:</div>
      <div class="enum-text">— получать от субъекта персональных данных достоверные информацию и/или документы,
        содержащие персональные данные;
      </div>
      <div class="enum-text">— в случае отзыва субъектом персональных данных согласия на обработку персональных данных,
        а также, направления обращения с требованием о прекращении обработки персональных данных, Оператор вправе
        продолжить обработку персональных данных без согласия субъекта персональных данных при наличии оснований,
        указанных в Законе о персональных данных;
      </div>
      <div class="enum-text">— самостоятельно определять состав и перечень мер, необходимых и достаточных для
        обеспечения выполнения обязанностей, предусмотренных Законом о персональных данных и принятыми в соответствии с
        ним нормативными правовыми актами, если иное не предусмотрено Законом о персональных данных или другими
        федеральными законами.
      </div>
      <div class="enum-text">3.2. Оператор обязан:</div>
      <div class="enum-text">— предоставлять субъекту персональных данных по его просьбе информацию, касающуюся
        обработки его персональных данных;
      </div>
      <div class="enum-text">— организовывать обработку персональных данных в порядке, установленном действующим
        законодательством РФ;
      </div>
      <div class="enum-text">— отвечать на обращения и запросы субъектов персональных данных и их законных
        представителей в соответствии с требованиями Закона о персональных данных;
      </div>
      <div class="enum-text">— сообщать в уполномоченный орган по защите прав субъектов персональных данных по запросу
        этого органа необходимую информацию в течение 10 дней с даты получения такого запроса;
      </div>
      <div class="enum-text">— публиковать или иным образом обеспечивать неограниченный доступ к настоящей Политике в
        отношении обработки персональных данных;
      </div>
      <div class="enum-text">— принимать правовые, организационные и технические меры для защиты персональных данных от
        неправомерного или случайного доступа к ним, уничтожения, изменения, блокирования, копирования, предоставления,
        распространения персональных данных, а также от иных неправомерных действий в отношении персональных данных;
      </div>
      <div class="enum-text">— прекратить передачу (распространение, предоставление, доступ) персональных данных,
        прекратить обработку и уничтожить персональные данные в порядке и случаях, предусмотренных Законом о
        персональных данных;
      </div>
      <div class="enum-text">— исполнять иные обязанности, предусмотренные Законом о персональных данных.</div>
      <h2 class="policy-subtitle">4. Основные права и обязанности субъектов персональных данных</h2>
      <div class="enum-text">4.1. Субъекты персональных данных имеют право:</div>
      <div class="enum-text">— получать информацию, касающуюся обработки его персональных данных, за исключением
        случаев, предусмотренных федеральными законами. Сведения предоставляются субъекту персональных данных Оператором
        в доступной форме, и в них не должны содержаться персональные данные, относящиеся к другим субъектам
        персональных данных, за исключением случаев, когда имеются законные основания для раскрытия таких персональных
        данных. Перечень информации и порядок ее получения установлен Законом о персональных данных;
      </div>
      <div class="enum-text">— требовать от оператора уточнения его персональных данных, их блокирования или уничтожения
        в случае, если персональные данные являются неполными, устаревшими, неточными, незаконно полученными или не
        являются необходимыми для заявленной цели обработки, а также принимать предусмотренные законом меры по защите
        своих прав;
      </div>
      <div class="enum-text">— выдвигать условие предварительного согласия при обработке персональных данных в целях
        продвижения на рынке товаров, работ и услуг;
      </div>
      <div class="enum-text">— на отзыв согласия на обработку персональных данных, а также, на направление требования о
        прекращении обработки персональных данных;
      </div>
      <div class="enum-text">— обжаловать в уполномоченный орган по защите прав субъектов персональных данных или в
        судебном порядке неправомерные действия или бездействие Оператора при обработке его персональных данных;
      </div>
      <div class="enum-text">— на осуществление иных прав, предусмотренных законодательством РФ.</div>
      <div class="enum-text">4.2. Субъекты персональных данных обязаны:</div>
      <div class="enum-text">— предоставлять Оператору достоверные данные о себе;</div>
      <div class="enum-text">— сообщать Оператору об уточнении (обновлении, изменении) своих персональных данных.</div>
      <div class="enum-text">4.3. Лица, передавшие Оператору недостоверные сведения о себе, либо сведения о другом
        субъекте персональных данных без согласия последнего, несут ответственность в соответствии с законодательством
        РФ.
      </div>
      <h2 class="policy-subtitle">5. Принципы обработки персональных данных</h2>
      <div class="enum-text">5.1. Обработка персональных данных осуществляется на законной и справедливой основе.</div>
      <div class="enum-text">5.2. Обработка персональных данных ограничивается достижением конкретных, заранее
        определенных и законных целей. Не допускается обработка персональных данных, несовместимая с целями сбора
        персональных данных.
      </div>
      <div class="enum-text">5.3. Не допускается объединение баз данных, содержащих персональные данные, обработка
        которых осуществляется в целях, несовместимых между собой.
      </div>
      <div class="enum-text">5.4. Обработке подлежат только персональные данные, которые отвечают целям их обработки.
      </div>
      <div class="enum-text">5.5. Содержание и объем обрабатываемых персональных данных соответствуют заявленным целям
        обработки. Не допускается избыточность обрабатываемых персональных данных по отношению к заявленным целям их
        обработки.
      </div>
      <div class="enum-text">5.6. При обработке персональных данных обеспечивается точность персональных данных, их
        достаточность, а в необходимых случаях и актуальность по отношению к целям обработки персональных данных.
        Оператор принимает необходимые меры и/или обеспечивает их принятие по удалению или уточнению неполных или
        неточных данных.
      </div>
      <div class="enum-text">5.7. Хранение персональных данных осуществляется в форме, позволяющей определить субъекта
        персональных данных, не дольше, чем этого требуют цели обработки персональных данных, если срок хранения
        персональных данных не установлен федеральным законом, договором, стороной которого, выгодоприобретателем или
        поручителем по которому является субъект персональных данных. Обрабатываемые персональные данные уничтожаются
        либо обезличиваются по достижении целей обработки или в случае утраты необходимости в достижении этих целей,
        если иное не предусмотрено федеральным законом.
      </div>
      <h2 class="policy-subtitle">6. Цели обработки персональных данных</h2>
      <table class="purpose-table">
        <tbody>
        <tr>
          <th>Цель обработки</th>
          <td class="purpose-field">
            Уточнение деталей заказа
          </td>
        </tr>

        <tr>
          <th>Персональные данные</th>
          <td class="purpose-field">
            <ul>
              <li>Номер телефона</li>
              <li>Имя</li>
            </ul>
          </td>
        </tr>

        <tr>
          <th>Правовые основания</th>
          <td class="purpose-field">
            <ul>
              <li>Федеральный закон «Об информации, информационных технологиях и о защите информации» от 27.07.2006 N
                149-ФЗ
              </li>
            </ul>
          </td>
        </tr>

        <tr>
          <th>Виды обработки персональных данных</th>
          <td class="purpose-field">
            <ul>
              <li>Сбор, запись, систематизация, накопление, хранение, уничтожение и обезличивание персональных данных
              </li>
            </ul>
          </td>
        </tr>

        </tbody>
      </table>
      <h2 class="policy-subtitle">7. Условия обработки персональных данных</h2>
      <div class="enum-text">7.1. Обработка персональных данных осуществляется с согласия субъекта персональных данных
        на обработку его персональных данных.
      </div>
      <div class="enum-text">7.2. Обработка персональных данных необходима для достижения целей, предусмотренных
        международным договором Российской Федерации или законом, для осуществления возложенных законодательством
        Российской Федерации на оператора функций, полномочий и обязанностей.
      </div>
      <div class="enum-text">7.3. Обработка персональных данных необходима для осуществления правосудия, исполнения
        судебного акта, акта другого органа или должностного лица, подлежащих исполнению в соответствии с
        законодательством Российской Федерации об исполнительном производстве.
      </div>
      <div class="enum-text">7.4. Обработка персональных данных необходима для исполнения договора, стороной которого
        либо выгодоприобретателем или поручителем по которому является субъект персональных данных, а также для
        заключения договора по инициативе субъекта персональных данных или договора, по которому субъект персональных
        данных будет являться выгодоприобретателем или поручителем.
      </div>
      <div class="enum-text">7.5. Обработка персональных данных необходима для осуществления прав и законных интересов
        оператора или третьих лиц либо для достижения общественно значимых целей при условии, что при этом не нарушаются
        права и свободы субъекта персональных данных.
      </div>
      <div class="enum-text">7.6. Осуществляется обработка персональных данных, доступ неограниченного круга лиц к
        которым предоставлен субъектом персональных данных либо по его просьбе (далее — общедоступные персональные
        данные).
      </div>
      <div class="enum-text">7.7. Осуществляется обработка персональных данных, подлежащих опубликованию или
        обязательному раскрытию в соответствии с федеральным законом.
      </div>
      <h2 class="policy-subtitle">8. Порядок сбора, хранения, передачи и других видов обработки персональных
        данных</h2>
      <div class="def-text">Безопасность персональных данных, которые обрабатываются Оператором, обеспечивается путем
        реализации правовых, организационных и технических мер, необходимых для выполнения в полном объеме требований
        действующего законодательства в области защиты персональных данных.
      </div>
      <div class="enum-text">8.1. Оператор обеспечивает сохранность персональных данных и принимает все возможные меры,
        исключающие доступ к персональным данным неуполномоченных лиц.
      </div>
      <div class="enum-text">8.2. Персональные данные Пользователя никогда, ни при каких условиях не будут переданы
        третьим лицам, за исключением случаев, связанных с исполнением действующего законодательства либо в случае, если
        субъектом персональных данных дано согласие Оператору на передачу данных третьему лицу для исполнения
        обязательств по гражданско-правовому договору.
      </div>
      <div class="enum-text">8.3. В случае выявления неточностей в персональных данных, Пользователь может
        актуализировать их самостоятельно, путем направления Оператору уведомление на адрес электронной почты Оператора
        {{ this.contacts.mail }} с пометкой «Актуализация персональных данных».
      </div>
      <div class="enum-text">8.4. Срок обработки персональных данных определяется достижением целей, для которых были
        собраны персональные данные, если иной срок не предусмотрен договором или действующим законодательством.
      </div>
      <div class="enum-text">Пользователь может в любой момент отозвать свое согласие на обработку персональных данных,
        направив Оператору уведомление посредством электронной почты на электронный адрес Оператора
        {{ this.contacts.mail }}
        с пометкой «Отзыв согласия на обработку персональных данных».
      </div>
      <div class="enum-text">8.5. Вся информация, которая собирается сторонними сервисами, в том числе платежными
        системами, средствами связи и другими поставщиками услуг, хранится и обрабатывается указанными лицами
        (Операторами) в соответствии с их Пользовательским соглашением и Политикой конфиденциальности. Субъект
        персональных данных и/или с указанными документами. Оператор не несет ответственность за действия третьих лиц, в
        том числе указанных в настоящем пункте поставщиков услуг.
      </div>
      <div class="enum-text">8.6. Установленные субъектом персональных данных запреты на передачу (кроме предоставления
        доступа), а также на обработку или условия обработки (кроме получения доступа) персональных данных, разрешенных
        для распространения, не действуют в случаях обработки персональных данных в государственных, общественных и иных
        публичных интересах, определенных законодательством РФ.
      </div>
      <div class="enum-text">8.7. Оператор при обработке персональных данных обеспечивает конфиденциальность
        персональных данных.
      </div>
      <div class="enum-text">8.8. Оператор осуществляет хранение персональных данных в форме, позволяющей определить
        субъекта персональных данных, не дольше, чем этого требуют цели обработки персональных данных, если срок
        хранения персональных данных не установлен федеральным законом, договором, стороной которого,
        выгодоприобретателем или поручителем по которому является субъект персональных данных.
      </div>
      <div class="enum-text">8.9. Условием прекращения обработки персональных данных может являться достижение целей
        обработки персональных данных, истечение срока действия согласия субъекта персональных данных, отзыв согласия
        субъектом персональных данных или требование о прекращении обработки персональных данных, а также выявление
        неправомерной обработки персональных данных.
      </div>
      <h2 class="policy-subtitle">9. Перечень действий, производимых Оператором с полученными персональными
        данными</h2>
      <div class="enum-text">9.1. Оператор осуществляет сбор, запись, систематизацию, накопление, хранение, уточнение
        (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ),
        обезличивание, блокирование, удаление и уничтожение персональных данных.
      </div>
      <div class="enum-text">9.2. Оператор осуществляет автоматизированную обработку персональных данных с получением
        и/или передачей полученной информации по информационно-телекоммуникационным сетям или без таковой.
      </div>
      <h2 class="policy-subtitle">10. Трансграничная передача персональных данных</h2>
      <div class="enum-text">10.1. Оператор до начала осуществления деятельности по трансграничной передаче персональных
        данных обязан уведомить уполномоченный орган по защите прав субъектов персональных данных о своем намерении
        осуществлять трансграничную передачу персональных данных (такое уведомление направляется отдельно от уведомления
        о намерении осуществлять обработку персональных данных).
      </div>
      <div class="enum-text">10.2. Оператор до подачи вышеуказанного уведомления, обязан получить от органов власти
        иностранного государства, иностранных физических лиц, иностранных юридических лиц, которым планируется
        трансграничная передача персональных данных, соответствующие сведения.
      </div>
      <h2 class="policy-subtitle">11. Конфиденциальность персональных данных</h2>
      <div class="def-text">Оператор и иные лица, получившие доступ к персональным данным, обязаны не раскрывать третьим
        лицам и не распространять персональные данные без согласия субъекта персональных данных, если иное не
        предусмотрено федеральным законом.
      </div>
      <h2 class="policy-subtitle">12. Заключительные положения</h2>
      <div class="enum-text">12.1. Пользователь может получить любые разъяснения по интересующим вопросам, касающимся
        обработки его персональных данных, обратившись к Оператору с помощью электронной почты {{ this.contacts.mail }}.
      </div>
      <div class="enum-text">12.2. В данном документе будут отражены любые изменения политики обработки персональных
        данных Оператором. Политика действует бессрочно до замены ее новой версией.
      </div>
      <div class="enum-text">12.3. Актуальная версия Политики в свободном доступе расположена в сети Интернет по адресу
        {{ this.policy_page }}.
      </div>
    </div>

  </div>

  <div class="union">
    <svg xmlns="http://www.w3.org/2000/svg" width="1716" height="656" viewBox="0 0 1716 656" fill="none">
      <path
          d="M1147.71 186.541C1197.49 54.9356 1331.2 -19.4501 1473.83 4.86829C1615.71 29.1867 1715.26 142.911 1716 281.669V656H1496.86V282.384C1496.86 228.741 1454.51 215.866 1435.94 213.005C1418.11 209.429 1373.54 207.998 1354.23 258.066L1206.37 656H973.279L1147.71 186.541Z"
          fill="white"/>
      <path
          d="M475.371 80.5768C617.257 104.18 716.8 218.62 716.8 357.378V656H498.4V357.378C498.4 304.449 456.057 290.859 437.486 287.998C419.657 285.137 375.086 283.707 355.772 333.774L200.598 656H-33.0283L150 260.819C199.029 130.644 332.743 56.2584 475.371 80.5768Z"
          fill="white"/>
    </svg>
  </div>

  <Footer
      :footer="this.header_block"
      @popUpCall="popUpCall()"
  />

  <RequestPopup
      :visible="requestPopUpVisible"
      @close="hidePopUp"
  />

</template>

<script>
import Header from "../components/base/Header.vue";
import Footer from "../components/base/Footer.vue";

import RequestPopup from "../components/base/RequestPopup.vue";
import axios from "axios";
import {useMeta} from "vue-meta";

export default {
  name: "PolicyView",
  inject: ['backendURL'],
  components: {
    Header,
    Footer,

    RequestPopup,
  },
  data() {
    return {
      header_block: {},
      contacts: {},
      requestPopUpVisible: false,

      domain: this.backendURL,
      policy_page: this.backendURL + '/policy',
      ip: 'ИП Камалетдиновым Ильназом Фиргатовичем',
    }
  },
  created() {
    this.getPageData()
  },
  mounted() {
    document.body.style.overflow = "";
    this.scrollToZero()
  },
  methods: {
    async getPageData() {
      await axios
          .get(`${this.backendURL}/api/v1/get_layout/`)
          .then(response => {
            this.header_block = response.data.header_block
            this.contacts = response.data.contacts_block
            window.ym(95108306, 'hit', 'https://kamamebel.com/policy')
            // console.log(response.data)
          })
          .catch(error => {
            console.log('An error occurred: ', error)
          })
    },

    popUpCall() {
      this.requestPopUpVisible = true;
      document.body.style.overflow = "hidden";
    },

    hidePopUp() {
      this.requestPopUpVisible = false;
      document.body.style.overflow = "";
    },

    scrollToZero() {
      document.documentElement.scrollTop = 0;
    }

  },

  setup() {
    const title = 'Политика конфиденциальности | Диваны в Казани от Кама - Лучшие мягкие диваны для вашего дома';
    const description = 'Политика конфиденциальности компании Кама. Купите мягкие диваны в Казани от Кама. Высокое качество, доступные цены, быстрая доставка и сборка. Сделайте правильный выбор!';

    useMeta({
      title: title,
      description: description,
      og: {
        title: title,
        type: 'website',
        url: 'https://kamamebel.com/',
        description: description,
        site_name: 'Диваны в Казани от Кама - Лучшие мягкие диваны для вашего дома',
        locale: 'ru_RU',
        image: 'https://kamamebel.com/images/meta-img.png',
        'image:alt': 'Изображение главной страницы сайта Кама. Диваны в Казани от Кама - Лучшие мягкие диваны для вашего дома.'
      },
      twitter: {
        card: 'summary',
        site: 'https://kamamebel.com/',
        title: title,
        description: description,
        image: 'https://kamamebel.com/images/meta-img.png',
        'image:alt': 'Изображение главной страницы сайта Кама. Диваны в Казани от Кама - Лучшие мягкие диваны для вашего дома.'
      },
    })
  }
}
</script>

<style scoped>
.policy-view {
  margin-top: 6.25rem;
  display: flex;
  justify-content: center;
  align-items: center;
  margin-left: 1rem;
  margin-right: 1rem;
}

.policy-max {
  max-width: 74rem;
  width: 100%;
}

.policy-title {
  text-align: center;
  padding-bottom: 2rem;
  font-family: OnestMedium, Inter, sans-serif;
  font-size: 2.5rem;
}

.policy-subtitle {
  font-size: 1.7rem;
  padding-top: 1rem;
  padding-bottom: 1rem;
}

.def-text {
  padding-bottom: 2rem;
  font-size: 1rem;
  line-height: 1.7;
  text-align: justify;
}

.enum-text {
  padding-left: 3rem;
  font-size: 1rem;
  line-height: 1.7;
  text-align: justify;
}

.purpose-table {
  margin-left: 3rem;
  border: 1px solid #d8d8d8;
  font-size: 1rem;
  line-height: 1.7rem;
}

.purpose-table th, .purpose-table td {
  vertical-align: top;
  padding: 0.5em 0.75em;
  border: 1px solid #d8d8d8;

}

.purpose-table th {
  width: 200px;
  text-align: left;
  font-weight: 500;
}

ul {
  padding-left: 1rem;
  margin-block-start: 0;
}

.union {
  bottom: -5rem;
  z-index: -1;
  position: relative;
  height: 26rem;
}

@media screen and (max-width: 1200px) {
  .policy-view {
    margin-top: 4rem;
  }

  .policy-title {
    font-size: 2.125rem;
  }

  .policy-subtitle {
    font-size: 1.5rem;
  }

  .union {
    bottom: 2rem;
    height: 20rem;
  }

  .union svg {
    width: 100%;
  }
}

@media screen and (max-width: 990px) {
  .policy-subtitle {
    font-size: 1.25rem;
  }

  .def-text, .enum-text, .purpose-table {
    font-size: 0.9375rem;
  }

  .enum-text {
    padding-left: 2rem;
  }

  .purpose-table {
    margin-left: 2rem;

  }

  .purpose-table th {
    width: 160px;
  }

  .union {
    bottom: 5rem;
    height: 17rem;
  }
}

@media screen and (max-width: 640px) {
  .policy-view {
    margin-top: 2rem;
  }

  .policy-title {
    font-size: 1.5rem;
  }

  .policy-subtitle {
    font-size: 1rem;
  }

  .def-text, .enum-text, .purpose-table {
    font-size: 0.875rem;
  }

  .enum-text {
    padding-left: 1.5rem;
  }

  .purpose-table {
    margin-left: 1.5rem;
  }

  .purpose-table th {
    width: 140px;
  }
}

@media screen and (max-width: 360px) {

}
</style>
