<template>
  <metainfo>
    <template v-slot:title="{ content, metainfo }">{{ content }}</template>
  </metainfo>

  <Header
      :header="this.header_block"
      @popUpCall="popUpCall()"
  />

  <div class="policy-view">
    <div class="policy-max">
      <h1 class="policy-title">Положения и условия</h1>

      <div class="default">
        Обновлено {{ this.update_date }}
      </div>

      <h2 class="subtitle">Общие положения</h2>

      <div class="default">Заходя на сайт «{{ this.title }}», Вы
        подтверждаете свое согласие и обязательность для Вас условий обслуживания, содержащихся в Условиях и положениях,
        изложенных ниже. Данные условия распространяются на весь сайт, а также на любую электронную почту или другой вид
        связи между Вами и сайтом «{{ this.title }}».
      </div>

      <div class="default">Ни при каких обстоятельствах сайт «{{ this.title }}» не несет
        ответственности за любые прямые, косвенные, специальные, случайные или косвенные убытки, включая, в частности,
        потерю данных или прибыли, возникшие в результате использования или невозможности использования материалов
        данного сайта, даже если «{{ this.title }}» или уполномоченный представитель был
        предупрежден о возможности такого ущерба. Если использование материалов данного сайта приводит к необходимости
        обслуживания, ремонта или исправления оборудования или данных, Вы берете на себя все расходы, связанные с этим.
      </div>

      <div class="default">Сайт «{{ this.title }}» не несет ответственности за любые
        последствия, которые могут возникнуть в процессе использования наших ресурсов. Мы оставляем за собой право в
        любой момент изменить цены и пересмотреть политику использования ресурсов.
      </div>

      <h2 class="subtitle">Лицензия</h2>

      <div class="default">Сайт «{{ this.title }}» предоставляет Вам отзывную,
        неисключительную, непередаваемую, ограниченную лицензию на загрузку, установку и использование сайта строго в
        соответствии с условиями настоящего Соглашения.
      </div>

      <h2 class="subtitle">Определения и ключевые термины</h2>

      <div class="default">Для настоящих Положений и условий:</div>

      <ul>
        <li><b>Cookie</b>: небольшой объем данных, генерируемый веб-сайтом и сохраняемый вашим браузером. Он
          используется для идентификации вашего браузера, предоставления аналитики, запоминания информации о Вас,
          например, языковых предпочтений или данных для входа в систему.
        </li>
        <li><b>Компания</b>: когда в данных Положениях и условиях упоминается "Компания", "мы", "нас" или "наш", то
          имеется в виду {{ this.ip }}, {{ this.legal_address }}, которая несет ответственность за Вашу информацию в
          соответствии с настоящей
          <router-link :to="{ name: 'policy' }">Политикой конфиденциальности</router-link>
          .
        </li>
        <li><b>Страна</b>: где находится сайт «{{ this.title }}» или владельцы/учредители сайта «{{ this.title }}», в
          данном случае - Россия.
        </li>
        <li><b>Клиент</b>: означает компанию, организацию, другое юридическое лицо или физическое лицо, которое
          соглашается на условия использования сайта «{{ this.title }}».
        </li>
        <li><b>Устройство</b>: любое подключенное к Интернету устройство, например, телефон, планшет, компьютер или
          любое другое устройство, которое может быть использовано для посещения сайта «{{ this.title }}» и пользования
          услугами.
        </li>
        <li><b>IP-адрес</b>: каждому устройству, подключенному к Интернету, присваивается номер, называемый IP-адресом
          (Internet protocol). Эти номера обычно присваиваются в географических блоках. IP-адрес часто используется для
          определения места, из которого устройство подключается к Интернету.
        </li>
        <li><b>Персонал</b>: относится к тем лицам, которые работают в Компании «{{ this.ip }}» или по договору
          выполняют услуги по поручению одной из сторон.
        </li>
        <li><b>Персональные данные</b>: любая информация, которая прямо, косвенно или в совокупности с другой
          информацией - в том числе персональный идентификационный номер - позволяет установить личность или
          идентифицировать физическое лицо.
        </li>
        <li><b>Услуги</b>: относится к услуге, предоставляемым сайтом «{{ this.title }}», как описано в соответствующих
          условиях (при наличии) и на данной платформе.
        </li>
        <li><b>Услуги третьих лиц</b>: относится к рекламодателям, спонсорам конкурсов, рекламным и маркетинговым
          партнерам и другим лицам, которые предоставляют наш контент или чьи продукты или услуги, по нашему мнению,
          могут Вас заинтересовать.
        </li>
        <li><b>Сайт</b>: сайт «{{ this.title }}», доступ к которому осуществляется по следующему URL: {{ this.domain }}.
        </li>
        <li><b>Вы</b>: физическое или юридическое лицо, посетившее сайт «{{ this.title }}» для использования Услуг.</li>

      </ul>

      <h2 class="subtitle">Ограничения</h2>

      <div class="default">
        Вы согласны не делать этого и не будете разрешать другим делать это:
      </div>

      <ul>
        <li>Лицензировать, продавать, сдавать, арендовать, переуступать, распространять, передавать, размещать,
          передавать на аутсорсинг, раскрывать или иным образом коммерчески использовать сервис или делать платформу
          доступной для любой третьей стороны.
        </li>
        <li>Изменять, создавать производные работы, разбирать, расшифровывать, компилировать или проводить обратное
          проектирование любой части Сайта.
        </li>
        <li>Удалять, изменять или скрывать любые уведомления о правах собственности (включая любые уведомления об
          авторских правах или товарных знаках) компании или ее филиалов, партнеров, поставщиков или лицензиаров
          сервиса.
        </li>
      </ul>

      <h2 class="subtitle">Ваши предложения</h2>

      <div class="default">
        Любые отзывы, комментарии, идеи, улучшения или предложения (далее "Предложения"), предоставленные вами нам в
        отношении сервиса, остаются исключительно нашей собственностью. Мы можем свободно использовать, копировать,
        изменять, публиковать или распространять Предложения в любых целях и любым способом без каких-либо упоминаний
        или компенсации.
      </div>

      <h2 class="subtitle">Ваше согласие</h2>

      <div class="default">Мы обновили наши Положения и условия, чтобы предоставить вам полную прозрачность в отношении
        того, что устанавливается, когда вы посещаете наш сайт, и как это используется. Используя наши услуги,
        регистрируя учетную запись или совершая покупку, вы тем самым соглашаетесь с нашими Положениями и условиями.
      </div>

      <h2 class="subtitle">Ссылки на другие сайты</h2>
      <div class="default">Наш Сайт может содержать ссылки на другие веб-сайты, которые не управляются Нами. Если Вы
        нажмете на ссылку третьей стороны, Вы будете направлены на сайт этой третьей стороны. Мы настоятельно
        рекомендуем вам ознакомиться с Условиями и положениями каждого сайта, который вы посещаете. Мы не контролируем и
        не несем ответственности за содержание, условия и положения или практику сайтов или служб третьих лиц.
      </div>

      <h2 class="subtitle">Cookies</h2>
      <div class="default">Мы используем "Cookies", чтобы определить, какие разделы нашего сайта вы посетили. Cookie -
        это небольшой фрагмент данных, сохраняемый на вашем компьютере или мобильном устройстве вашим веб-браузером. Мы
        используем "Cookies" для повышения производительности и функциональности нашего Сайта, но их использование не
        является обязательным. Тем не менее, без этих файлов cookie некоторые функции, например, видео, могут стать
        недоступными, или вам придется вводить свои данные для входа в систему каждый раз, когда вы посещаете нашу
        платформу, поскольку мы не сможем вспомнить, что вы уже входили в систему. Большинство веб-браузеров могут быть
        настроены на отключение использования Cookies. Однако если вы отключите Cookies, вы, возможно, не сможете
        правильно или вообще не сможете получить доступ к функциям нашего сайта. Мы никогда не размещаем в Cookies
        информацию, позволяющую идентифицировать личность.
      </div>

      <h2 class="subtitle">Изменения в наших положениях и условиях</h2>
      <div class="default">Вы признаете и соглашаетесь, что мы можем прекратить (постоянно или временно) предоставление
        Сайта (или любых функций в рамках Сайта) вам или пользователям в целом по нашему собственному усмотрению, без
        предварительного уведомления вас. Вы можете прекратить использование Сайта в любое время. Вам не нужно
        специально информировать нас о прекращении использования Сайта. Вы признаете и соглашаетесь, что если мы
        отключим доступ к вашей учетной записи, вы можете быть лишены доступа к Сайту, данным вашей учетной записи или
        любым файлам или другим материалам, которые содержатся в вашей учетной записи. Если мы решим изменить наши
        Положения и условия, мы опубликуем эти изменения на этой странице и/или обновим дату изменения Положений и
        условий.
      </div>

      <h2 class="subtitle">Изменения в наших услугах</h2>
      <div class="default">Мы оставляем за собой право изменять, приостанавливать или прекращать, временно или
        постоянно, услугу с уведомлением или без него и без ответственности перед вами.
      </div>

      <h2 class="subtitle">Обновления в нашем сервисе</h2>
      <div class="default">Время от времени мы можем предоставлять усовершенствования или улучшения функций/функционала
        услуги, которые могут включать исправления, исправления ошибок, обновления, модернизацию и другие изменения
        ("Обновления"). Обновления могут изменять или удалять определенные особенности и/или функциональные возможности
        услуги. Вы соглашаетесь, что мы не обязаны (i) предоставлять какие-либо Обновления, или (ii) продолжать
        предоставлять или включать какие-либо определенные возможности и/или функции услуги для вас. Вы также
        соглашаетесь, что все Обновления будут (i) считаться неотъемлемой частью услуги и (ii) подчиняться настоящим
        Положениям и условиям.
      </div>

      <h2 class="subtitle">Услуги третьих лиц</h2>
      <div class="default">Мы можем отображать, включать или делать доступным контент третьих лиц (включая данные,
        информацию, приложения и другие продукты услуги) или предоставлять ссылки на веб-сайты или услуги третьих лиц
        ("Услуги третьих лиц"). Вы признаете и соглашаетесь, что мы не несем ответственности за любые Услуги третьих
        лиц, включая их точность, полноту, своевременность, действительность, соблюдение авторских прав, законность,
        пристойность, качество или любые другие аспекты. Мы не принимаем на себя и не несем никакой ответственности
        перед вами или любым другим физическим или юридическим лицом за любые Услуги третьих лиц. Услуги третьих лиц и
        ссылки на них предоставляются исключительно для вашего удобства, и вы получаете доступ и используете их
        исключительно на свой страх и риск и в соответствии с положениями и условиями таких третьих лиц.
      </div>

      <h2 class="subtitle">Срок и прекращение действия</h2>
      <div class="default">Настоящее Соглашение остается в силе до тех пор, пока оно не будет расторгнуто вами или нами.
        Мы можем по своему усмотрению в любое время и по любой причине приостановить или прекратить действие настоящего
        Соглашения с предварительным уведомлением или без него. Настоящее Соглашение прекращает свое действие
        немедленно, без предварительного уведомления с нашей стороны, в случае невыполнения вами любого положения
        настоящего Соглашения. Вы также можете расторгнуть настоящее Соглашение, удалив услугу и все ее копии со своего
        компьютера. После прекращения действия настоящего Соглашения вы должны прекратить любое использование сервиса и
        удалить все копии сервиса с вашего компьютера. Прекращение действия настоящего Соглашения не ограничивает
        никаких наших прав или средств правовой защиты по закону или по справедливости в случае нарушения вами (в
        течение срока действия настоящего Соглашения) любого из ваших обязательств по настоящему Соглашению.
      </div>
      <div class="default">
        Если вы являетесь владельцем авторских прав или агентом такого владельца и считаете, что какой-либо наш материал
        нарушает ваши авторские права, свяжитесь с нами, предоставив следующую информацию: (a) физическую или
        электронную подпись владельца авторских прав или лица, уполномоченного действовать от его имени; (b)
        идентификацию материала, который, как утверждается, нарушает авторские права; (c) вашу контактную информацию,
        включая ваш адрес, номер телефона и адрес электронной почты; (d) заявление о том, что вы добросовестно
        полагаете, что использование материала не разрешено владельцами авторских прав; и (e) заявление о том, что
        информация в уведомлении является точной, и под страхом наказания за лжесвидетельство вы уполномочены
        действовать от имени владельца.
      </div>

      <h2 class="subtitle">Возмещение убытков</h2>
      <div class="default">Вы соглашаетесь возместить ущерб и оградить нас, наши родительские компании, дочерние
        компании, филиалы, должностных лиц, сотрудников, агентов, партнеров и лицензиаров (если таковые имеются) от
        любых претензий или требований, включая разумные гонорары адвокатов, вызванных или возникших в результате
        вашего: (a) использования сервиса; (b) нарушения настоящего Соглашения или любого закона или постановления; или
        (c) нарушения любого права третьей стороны.
      </div>

      <h2 class="subtitle">Без гарантий</h2>
      <div class="default">Услуги Сайта предоставляются вам "КАК ЕСТЬ" и "КАК ДОСТУПНО", со всеми недостатками и
        дефектами без каких-либо гарантий. В максимальной степени, разрешенной действующим законодательством, мы, от
        своего имени и от имени наших аффилированных лиц и наших соответствующих лицензиаров и поставщиков услуг, прямо
        отказываемся от всех гарантий, явных, подразумеваемых, установленных законом или иных, в отношении сервиса,
        включая все подразумеваемые гарантии товарного состояния, пригодности для конкретной цели, права собственности и
        ненарушения прав, а также гарантии, которые могут вытекать из хода дел, хода исполнения, использования или
        торговой практики. Без ограничения вышеизложенного, мы не предоставляем никаких гарантий и не делаем никаких
        заявлений любого рода, что услуга будет соответствовать вашим требованиям, достигать любых намеченных
        результатов, быть совместимой или работать с любым другим программным обеспечением, веб-сайтами, системами или
        услугами, работать без перебоев, соответствовать любым стандартам производительности или надежности, быть
        безошибочной или что любые ошибки или дефекты могут быть или будут исправлены.
      </div>
      <div class="default">Не ограничивая вышесказанное, ни мы, ни любой провайдер не делаем никаких заявлений или
        гарантий любого рода, явных или подразумеваемых: (i) в отношении работы или доступности сервиса, информации,
        контента, материалов или продуктов, включенных в него; (ii) что сервис будет работать непрерывно или без ошибок;
        (iii) в отношении точности, надежности или актуальности любой информации или контента, предоставляемого через
        сервис; или (iv) что сервис, его серверы, контент или электронные письма, отправленные от нас или от имени нас,
        не содержат вирусов, скриптов, троянских коней, червей, вредоносных программ или других вредных компонентов. В
        некоторых юрисдикциях не допускается исключение или ограничение подразумеваемых гарантий или ограничение
        применимых законных прав потребителя, поэтому некоторые или все вышеуказанные исключения и ограничения могут к
        вам не относиться.
      </div>

      <h2 class="subtitle">Ограничение ответственности</h2>
      <div class="default">Несмотря на любой ущерб, который вы можете понести, вся ответственность нас и любого из наших
        поставщиков по любому положению настоящего Соглашения и ваше исключительное средство правовой защиты в отношении
        всего вышесказанного ограничивается суммой, фактически уплаченной вами за услугу. В максимальной степени,
        разрешенной действующим законодательством, мы или наши поставщики ни при каких обстоятельствах не несем
        ответственности за любые специальные, случайные, косвенные или последующие убытки (включая, но не ограничиваясь
        ими, убытки от потери прибыли, потери данных или другой информации, перерыва в работе, травмы, за потерю
        конфиденциальности, возникшие в результате или каким-либо образом связанные с использованием или невозможностью
        использования услуги, программного обеспечения третьих лиц и/или аппаратных средств третьих лиц, используемых с
        услугой, или иным образом связанные с любым положением настоящего Соглашения), даже если мы или любой поставщик
        были предупреждены о возможности таких убытков и даже если средство правовой защиты не достигло своей основной
        цели. В некоторых регионках не допускается исключение или ограничение случайных или косвенных убытков, поэтому
        вышеуказанное ограничение или исключение может не распространяться на вас.
      </div>

      <h2 class="subtitle">Делимость</h2>
      <div class="default">Если какое-либо положение настоящего Соглашения будет признано неисполнимым или
        недействительным, такое положение будет изменено и истолковано для достижения целей такого положения в
        максимально возможной степени в соответствии с применимым законодательством, а остальные положения останутся в
        полной силе и действии.
      </div>
      <div class="default">Настоящее Соглашение, а также Политика конфиденциальности и любые другие юридические
        уведомления, опубликованные нами на Сайете, представляют собой полное соглашение между вами и нами относительно
        Сайта. Если какое-либо положение настоящего Соглашения будет признано недействительным судом компетентной
        юрисдикции, недействительность такого положения не влияет на действительность остальных положений настоящего
        Соглашения, которые остаются в полной силе и действии. Никакой отказ от какого-либо условия настоящего
        Соглашения не будет считаться дальнейшим или продолжающимся отказом от такого условия или любого другого
        условия, и наш отказ от отстаивания какого-либо права или положения по настоящему Соглашению не будет означать
        отказ от такого права или положения. ВЫ И МЫ СОГЛАШАЕМСЯ, ЧТО ЛЮБОЙ ИСК, ВЫТЕКАЮЩИЙ ИЗ СЕРВИСОВ ИЛИ СВЯЗАННЫЙ С
        НИМИ, ДОЛЖЕН БЫТЬ ПОДАН В ТЕЧЕНИЕ ОДНОГО (1) ГОДА ПОСЛЕ ВОЗНИКНОВЕНИЯ ИСКА. В ПРОТИВНОМ СЛУЧАЕ ТАКИЕ ОСНОВАНИЯ
        ДЛЯ ИСКА НАВСЕГДА ОТПАДАЮТ.
      </div>


      <h2 class="subtitle">Отказ</h2>
      <div class="default">За исключением случаев, предусмотренных настоящим Соглашением, неиспользование права или
        неисполнение обязательства по настоящему Соглашению не влияет на способность стороны воспользоваться таким
        правом или потребовать исполнения такого обязательства в любое последующее время, а также отказ от нарушения
        означает отказ от любого последующего нарушения.
      </div>
      <div class="default">Неиспользование и задержка в использовании любой из сторон любого права или любого полномочия
        по настоящему Соглашению не будет означать отказ от этого права или полномочия. Разовое или частичное
        осуществление любого права или полномочия по настоящему Соглашению также не препятствует дальнейшему
        осуществлению этого или любого другого права, предоставленного настоящим Соглашением. В случае противоречия
        между настоящим Соглашением и любыми применимыми условиями покупки или другими условиями действуют условия
        настоящего Соглашения.
      </div>

      <h2 class="subtitle">Поправки к настоящему Соглашению</h2>
      <div class="default">Мы оставляем за собой право по собственному усмотрению изменять или заменять настоящее
        Соглашение в любое время. Если изменения будут существенными, мы уведомим об этом не менее чем за 30 дней до
        вступления в силу новых условий. Что является существенным изменением, будет определяться исключительно по
        нашему усмотрению. Продолжая получать доступ или использовать наш сервис после вступления в силу изменений, вы
        соглашаетесь соблюдать пересмотренные условия. Если вы не согласны с новыми условиями, вы больше не имеете права
        пользоваться нашим сервисом.
      </div>

      <h2 class="subtitle">Полное соглашение</h2>
      <div class="default">Соглашение представляет собой полное соглашение между вами и нами относительно использования
        вами Сайта и заменяет собой все предыдущие и современные письменные или устные соглашения между вами и нами.
      </div>
      <div class="default">На вас могут распространяться дополнительные положения и условия, действующие при
        использовании или покупке у нас других услуг, которые мы сообщим вам во время такого использования или покупки.
      </div>

      <h2 class="subtitle">Интеллектуальная собственность</h2>
      <div class="default">Наша платформа и все ее содержимое, функции и возможности (включая, помимо прочего, всю
        информацию, программное обеспечение, текст, дисплеи, изображения, видео и аудио, а также дизайн, выбор и
        расположение этих материалов) принадлежат нам, ее лицензиарам или другим поставщикам таких материалов и защищены
        международными законами об авторском праве, товарных знаках, патентах, коммерческой тайне и другой
        интеллектуальной собственности или правах собственности. Материал не может быть скопирован, изменен,
        воспроизведен, загружен или распространен каким-либо образом, полностью или частично, без предварительного
        письменного разрешения с нашей стороны, за исключением случаев, прямо предусмотренных настоящими Положениями и
        условиями. Любое несанкционированное использование материала запрещено.
      </div>

      <h2 class="subtitle">Соглашение об арбитраже</h2>
      <div class="default">Данный раздел применяется к любому спору, ЗА ИСКЛЮЧЕНИЕМ ТОГО, ЧТОБЫ НЕ ВКЛЮЧАТЬ СПОР,
        ОТНОСЯЩИЙСЯ К ИСКАМ О ВЗАИМОВЫГОДНОМ ИЛИ СУДЕБНОМ ВОЗМЕЩЕНИИ В ОТНОШЕНИИ НАРУШЕНИЯ ИЛИ ВАЖНОСТИ ПРАВ НА
        ИНТЕЛЛЕКТУАЛЬНУЮ СОБСТВЕННОСТЬ. Термин "спор" означает любой спор, иск или иное разногласие между вами и нами в
        отношении Сайта или настоящего соглашения, будь то договор, гарантия, правонарушение, закон, постановление,
        указ или любое другое правовое или справедливое основание. Слову "спор" будет придаваться максимально широкое
        значение, допустимое по закону.
      </div>

      <h2 class="subtitle">Уведомление о споре</h2>
      <div class="default">В случае возникновения спора вы или мы должны направить другой стороне Уведомление о споре,
        которое представляет собой письменное заявление, содержащее имя, адрес и контактную информацию стороны,
        направившей уведомление, факты, послужившие основанием для спора, и запрашиваемую помощь. Вы должны отправить
        Уведомление о споре по электронной почте по адресу: . Мы отправим вам любое уведомление о споре по почте на ваш
        адрес, если он у нас есть, или иным образом на ваш адрес электронной почты. Вы и мы попытаемся разрешить любой
        спор путем неформальных переговоров в течение шестидесяти (60) дней с даты отправки Уведомления о споре. По
        истечении шестидесяти (60) дней вы или мы можем начать арбитражное разбирательство.
      </div>

      <h2 class="subtitle">Обязательный арбитраж</h2>
      <div class="default">Если вы и мы не разрешим какой-либо спор путем неформальных переговоров, любые другие усилия
        по разрешению спора будут предприняты исключительно путем обязательного арбитража, как описано в данном разделе.
        Вы отказываетесь от права вести судебное разбирательство (или участвовать в нем в качестве стороны или члена
        группы) по всем спорам в суде перед судьей или присяжными. Спор должен быть разрешен путем обязательного
        арбитража в соответствии с правилами коммерческого арбитража Американской арбитражной ассоциации. Любая из
        сторон может добиваться любого временного или предварительного судебного запрета от любого суда компетентной
        юрисдикции, если это необходимо для защиты прав или собственности стороны до завершения арбитражного
        разбирательства. Любые и все юридические, бухгалтерские и прочие расходы, гонорары и издержки, понесенные
        выигравшей стороной, будут возложены на невыигравшую сторону.
      </div>

      <h2 class="subtitle">Представления и конфиденциальность</h2>
      <div class="default">В случае, если вы предоставляете или размещаете какие-либо идеи, творческие предложения,
        проекты, фотографии, информацию, рекламу, данные или предложения, включая идеи новых или улучшенных продуктов,
        услуг, функций, технологий или рекламных акций, вы однозначно соглашаетесь с тем, что такие материалы будут
        автоматически рассматриваться как не конфиденциальные и не являющиеся собственностью и станут исключительной
        собственностью нас без какой-либо компенсации или кредита для вас. Мы и наши аффилированные лица не несем
        никаких обязательств в отношении таких материалов или сообщений и можем использовать идеи, содержащиеся в таких
        материалах или сообщениях, для любых целей в любых средствах массовой информации в бессрочном порядке, включая,
        помимо прочего, разработку, производство и маркетинг продуктов и услуг с использованием таких идей.
      </div>

      <h2 class="subtitle">Акции</h2>
      <div class="default">Время от времени мы можем проводить конкурсы, акции, тотализаторы и другие мероприятия
        ("Акции"), которые требуют от вас предоставления материалов или информации о себе. Обратите внимание, что все
        Акции могут регулироваться отдельными правилами, которые могут содержать определенные квалификационные
        требования, например, ограничения по возрасту и географическому положению. Вы обязаны ознакомиться со всеми
        правилами Акций, чтобы определить, имеете ли вы право на участие. Если вы участвуете в какой-либо Акции, вы
        соглашаетесь соблюдать и выполнять все Правила Акций. Дополнительные положения и условия могут применяться к
        покупкам товаров или услуг на Сайте.
      </div>

      <h2 class="subtitle">Типографские ошибки</h2>
      <div class="default">В случае, если продукт и/или услуга указаны по неправильной цене или с неправильной
        информацией из-за опечатки, мы имеем право отказать или отменить любые заказы, размещенные на продукт и/или
        услугу, указанные по неправильной цене. Мы имеем право отказать или отменить любой такой заказ, независимо от
        того, был ли подтвержден заказ и списана ли плата с вашей кредитной карты. Если с вашей кредитной карты уже была
        снята плата за покупку, и ваш заказ будет отменен, мы немедленно выдадим кредит на счет вашей кредитной карты
        или другой платежный счет на сумму списания.
      </div>

      <h2 class="subtitle">Разное</h2>
      <div class="default">Если по какой-либо причине суд компетентной юрисдикции признает какое-либо положение или
        часть настоящих Положений и условий не имеющими законной силы, остальные положения и условия продолжают
        действовать в полном объеме. Любой отказ от любого положения настоящих Положений и условий будет иметь силу
        только в том случае, если он оформлен в письменном виде и подписан уполномоченным представителем нашей компании.
        В случае любого нарушения или предполагаемого нарушения с вашей стороны мы имеем право на судебный запрет или
        другие средства правовой защиты (без обязательств по размещению какого-либо залога или поручительства). Мы
        управляем и контролируем наш Сайт из наших офисов в г. Казань. Сайт не предназначен для распространения или
        использования любым физическим или юридическим лицом в любой юрисдикции или стране, где такое распространение
        или использование противоречит законодательству или нормативным актам. Соответственно, лица, решившие получить
        доступ к нашему Сайту из других мест, делают это по собственной инициативе и несут полную ответственность за
        соблюдение местных законов, если и в какой степени применимы местные законы. Настоящие Положения и условия
        (которые включают в себя и включают нашу Политику конфиденциальности) содержат полное понимание и заменяют все
        предыдущие договоренности между вами и нами относительно их предмета, и не могут быть изменены или
        модифицированы вами. Заголовки разделов, используемые в настоящем Соглашении, предназначены только для удобства
        и не имеют юридического значения.
      </div>

      <h2 class="subtitle">Отказ от ответственности</h2>
      <div class="default">Мы не несем ответственности за содержание, код или любые другие неточности. Мы не
        предоставляем гарантий или поручительств. Ни при каких обстоятельствах мы не несем ответственности за какие-либо
        специальные, прямые, косвенные, побочные или случайные убытки или любые другие убытки, будь то в случае иска по
        контракту, халатности или другого правонарушения, возникшие в результате или в связи с использованием Сайта
        или содержимого Сайта. Мы оставляем за собой право вносить дополнения, удаления или изменения в содержание
        Сайта в любое время без предварительного уведомления.
      </div>
      <div class="default">Наш Сайт и его содержимое предоставляются "как есть" и "как доступно" без каких-либо
        гарантий или заявлений любого рода, явных или подразумеваемых. Мы являемся дистрибьютором, а не издателем
        контента, предоставляемого третьими лицами; как таковые, мы не осуществляем редакционный контроль над таким
        контентом и не даем никаких гарантий или заявлений относительно точности, надежности или актуальности любой
        информации, контента, услуг или товаров, предоставляемых через или доступных через наш Сайт. Не ограничивая
        вышесказанное, мы специально отказываемся от всех гарантий и заявлений в отношении любого контента,
        передаваемого через или в связи с нашим Сайтом или на сайтах, которые могут появляться как ссылки на нашем
        Сайте, или в продуктах, предоставляемых как часть или иным образом связанных с нашим Сайтом, включая, без
        ограничений, любые гарантии товарного состояния, пригодности для конкретной цели. Никакие устные советы или
        письменная информация, предоставленная нами или любыми из наших аффилированных
        лиц, сотрудников, должностных лиц, директоров, агентов и т.п., не создают гарантий. Информация о ценах и наличии
        товара может быть изменена без предварительного уведомления. Не ограничивая вышесказанное, мы не гарантируем,
        что наш Персонал будет работать непрерывно, без сбоев, своевременно или без ошибок.
      </div>


      <h2 class="subtitle">Связаться с нами</h2>
      <div class="default">Не стесняйтесь обращаться к нам, если у вас возникнут вопросы.</div>
      <ul>
        <li>По электронной почте: {{ this.contacts.mail }}</li>
        <li>По номеру телефона: {{ this.contacts.number }}</li>
      </ul>

    </div>

  </div>

  <div class="union">
    <svg xmlns="http://www.w3.org/2000/svg" width="1716" height="656" viewBox="0 0 1716 656" fill="none">
      <path
          d="M1147.71 186.541C1197.49 54.9356 1331.2 -19.4501 1473.83 4.86829C1615.71 29.1867 1715.26 142.911 1716 281.669V656H1496.86V282.384C1496.86 228.741 1454.51 215.866 1435.94 213.005C1418.11 209.429 1373.54 207.998 1354.23 258.066L1206.37 656H973.279L1147.71 186.541Z"
          fill="white"/>
      <path
          d="M475.371 80.5768C617.257 104.18 716.8 218.62 716.8 357.378V656H498.4V357.378C498.4 304.449 456.057 290.859 437.486 287.998C419.657 285.137 375.086 283.707 355.772 333.774L200.598 656H-33.0283L150 260.819C199.029 130.644 332.743 56.2584 475.371 80.5768Z"
          fill="white"/>
    </svg>
  </div>

  <Footer
      :footer="this.header_block"
      @popUpCall="popUpCall()"
  />

  <RequestPopup
      :visible="requestPopUpVisible"
      @close="hidePopUp"
  />

</template>

<script>
import Header from "../components/base/Header.vue";
import Footer from "../components/base/Footer.vue";

import RequestPopup from "../components/base/RequestPopup.vue";
import axios from "axios";
import {useMeta} from "vue-meta";

export default {
  name: "TermsView",
  inject: ['backendURL'],
  components: {
    Header,
    Footer,

    RequestPopup,
  },
  data() {
    return {
      header_block: {},
      contacts: {},
      requestPopUpVisible: false,

      update_date: '2023-09-27',
      title: 'Диваны в Казани от Кама - Лучшие мягкие диваны для вашего дома',
      ip: 'ИП Камалетдинов Ильназ Фирагтович',
      legal_address: 'Россия, респ. Татарстан, г. Казань, ул. 2-й пер. Юл Урам, д. 11',
      domain: this.backendURL,
    }
  },
  created() {
    this.getPageData()
  },
  mounted() {
    document.body.style.overflow = "";
    this.scrollToZero()
  },
  methods: {
    async getPageData() {
      await axios
          .get(`${this.backendURL}/api/v1/get_layout/`)
          .then(response => {
            this.header_block = response.data.header_block
            this.contacts = response.data.contacts_block
            // console.log(response.data)
            window.ym(95108306, 'hit', 'https://kamamebel.com/terms')
          })
          .catch(error => {
            console.log('An error occurred: ', error)
          })
    },

    popUpCall() {
      this.requestPopUpVisible = true;
      document.body.style.overflow = "hidden";
    },
    hidePopUp() {
      this.requestPopUpVisible = false;
      document.body.style.overflow = "";
    },
    scrollToZero() {
      document.documentElement.scrollTop = 0;
    }

  },
  setup() {
    const title = 'Положения и условия | Диваны в Казани от Кама - Лучшие мягкие диваны для вашего дома';
    const description = 'Положения и условия компании Кама. Купите мягкие диваны в Казани от Кама. Высокое качество, доступные цены, быстрая доставка и сборка. Сделайте правильный выбор!';

    useMeta({
      title: title,
      description: description,
      og: {
        title: title,
        type: 'website',
        url: 'https://kamamebel.com/',
        description: description,
        site_name: 'Диваны в Казани от Кама - Лучшие мягкие диваны для вашего дома',
        locale: 'ru_RU',
        image: 'https://kamamebel.com/images/meta-img.png',
        'image:alt': 'Изображение главной страницы сайта Кама. Диваны в Казани от Кама - Лучшие мягкие диваны для вашего дома.'
      },
      twitter: {
        card: 'summary',
        site: 'https://kamamebel.com/',
        title: title,
        description: description,
        image: 'https://kamamebel.com/images/meta-img.png',
        'image:alt': 'Изображение главной страницы сайта Кама. Диваны в Казани от Кама - Лучшие мягкие диваны для вашего дома.'
      },
    })
  }
}
</script>

<style scoped>
.policy-view {
  margin-top: 6.25rem;
  display: flex;
  justify-content: center;
  align-items: center;
  margin-left: 1rem;
  margin-right: 1rem;
}

.policy-max {
  max-width: 74rem;
  width: 100%;
}

.policy-title {
  text-align: center;
  padding-bottom: 2rem;
  font-family: OnestMedium, Inter, sans-serif;
  font-size: 2.5rem;
}

.subtitle {
  font-size: 1.7rem;
  padding-top: 1rem;
  padding-bottom: 1rem;
}

.default {
  padding-bottom: 2rem;
  font-size: 1rem;
  line-height: 1.7;
  text-align: justify;
}

li {
  font-size: 1rem;
  line-height: 1.7;
  text-align: justify;
}


ul {
  padding-left: 2rem;
  margin-block-start: 0;
}


.union {
  bottom: -5rem;
  z-index: -1;
  position: relative;
  height: 26rem;
}

@media screen and (max-width: 1200px) {
  .policy-view {
    margin-top: 4rem;
  }

  .policy-title {
    font-size: 2.125rem;
  }

  .subtitle {
    font-size: 1.5rem;
  }

  .union {
    bottom: 2rem;
    height: 20rem;
  }

  .union svg {
    width: 100%;
  }
}

@media screen and (max-width: 990px) {
  .subtitle {
    font-size: 1.25rem;
  }

  .default, li {
    font-size: 0.9375rem;
  }

  .union {
    bottom: 5rem;
    height: 17rem;
  }
}

@media screen and (max-width: 640px) {
  .policy-view {
    margin-top: 2rem;
  }

  .policy-title {
    font-size: 1.5rem;
  }

  .subtitle {
    font-size: 1rem;
  }

  .default, li {
    font-size: 0.875rem;
  }
}

@media screen and (max-width: 360px) {

}
</style>
